{
  "personal": {
    "name": "Osazee Jedidiah O",
    "title": "Blockchain Developer, Program Manager and Data Scientist",
    "bio": "I am a data-centric, self-motivated, dedicated, goal-oriented individual with decent moral Values and Ethicates along with a high-energy level, honed communication skills, strong organizational skills, and meticulous attention to detail. I am involved in innovating and building Dapps that solve key problems in society and driving massive adoption of blockchain technology. I am currently interested in building to scaling ethereum(L2 solutions) and Deploy Products that integrates A.I and Blockchain technology.",
    "subtitle": "I love exploring new things!",
    "description": "I'm a Blockchain developer, Program Manager and Data scientist. Primarily interested in Blockchain Development and Leading teams to deploying quality products on time and in budget. I enjoy learning new skills and implementing them in real life!",
    "email": "oghagbonosazee20@gmail.com",
    "avatar": "osazeeJedi.jpeg",
    "skills": [
      "Coding",
      "Writing",
      "Program Management",
      "Public Speaking",
      "Problem Solving",
      "Team Management",
      "Mentoring"
    ]
  },
  "experience": [
    {
      "id": 1,
      "title": "Software Engineer",
      "company": "StormBot",
      "location": "Remote",
      "range": "Feb 2024 – Present",
      "url": "https://stormbotx.io",
      "date": "2024-02-01",
      "responsibilities": [
        "Built and maintained real-time trading automation features with Node.js, React, PostgreSQL, and AWS, supporting 10k+ transactions daily",
        "Deployed event-driven architectures that reduced trade execution latency by 30%, enabling instant swaps and live notifications",
        "Integrated secure wallet services, processing crypto transfers valued at $5M+ monthly with high reliability",
        "Enhanced analytics dashboards and data models, improving trader decision-making by providing real-time portfolio insights"
      ]
    },
    {
      "id": 2,
      "title": "Technical Programs Lead",
      "company": "KnowTheBlocks Maven",
      "location": "Remote (Nigeria, US)",
      "range": "May 2023 – Present",
      "url": "https://knowtheblocks.org",
      "date": "2023-05-01",
      "responsibilities": [
        "Architected and deployed offline-first logistics and training platforms using Node.js, PostgreSQL, and AWS, achieving 99.5% system uptime across unstable internet environments",
        "Designed and executed scalable codebases used by over 200 interns at Veritas University and additional partner institutions",
        "Automated event-driven workflows, reducing manual reporting time by 40%",
        "Led cross-border engineering teams in Nigeria and the US, improving collaboration velocity by 20% through structured code reviews and agile practices"
      ]
    },
    {
      "id": 3,
      "title": "Lead Blockchain & Software Architect",
      "company": "Blockwave Consult",
      "location": "Lagos, Nigeria",
      "range": "Aug 2022 – Present",
      "url": "#",
      "date": "2022-08-01",
      "responsibilities": [
        "Led design and development of enterprise-grade blockchain and full stack systems for fintech, logistics, and governance clients",
        "Architected event-driven Node.js + PostgreSQL platforms that scaled to 50k+ monthly users across distributed environments",
        "Deployed blockchain-based identity and payments infrastructure, enabling secure cross-border transactions with 99% reliability",
        "Designed data models and reporting flows that improved supply chain visibility and reduced reconciliation time by 25% for client operations",
        "Guided a distributed engineering team, increasing delivery efficiency through code quality enforcement and agile practices",
        "Delivered offline-first, serverless solutions that supported logistics operations in areas with intermittent internet connectivity"
      ]
    },
    {
      "id": 4,
      "title": "Blockchain Developer",
      "company": "Web3Bridge",
      "location": "Lagos, Nigeria",
      "range": "Jan 2022 – Aug 2022",
      "url": "https://www.web3bridge.com/",
      "date": "2022-01-01",
      "responsibilities": [
        "Built and deployed smart contracts (EIP-2535 upgradeable architecture) supporting decentralized apps with <5% gas cost savings through optimization",
        "Integrated advanced cryptography (Merkle trees, zkProofs) to enhance transaction security and scalability"
      ]
    },
    {
      "id": 5,
      "title": "Senior Program Manager / Program Manager",
      "company": "Coven Works",
      "location": "Nigeria / US (Remote)",
      "range": "May 2021 – Feb 2022",
      "url": "https://www.covenworks.com/",
      "date": "2021-05-01",
      "responsibilities": [
        "Oversaw enterprise tech programs with budgets exceeding $100k, delivering solutions that scaled to hundreds of learners and clients",
        "Designed and implemented data-driven systems that increased AI program enrollments by 12% month-over-month",
        "Applied analytics to improve operational reporting efficiency, cutting reporting lag by 30%",
        "Facilitated cross-cultural collaboration across Nigeria and the US, enabling smoother distributed delivery"
      ]
    },
    {
      "id": 6,
      "title": "Data Alchemist - Quest Designer",
      "company": "CovalentHQ",
      "location": "Remote (Contract)",
      "range": "June 2022 - December 2022",
      "url": "https://www.covalenthq.com/",
      "date": "2022-06-01",
      "responsibilities": [
        "Designed and managed quests for the Covalent Data Alchemist program",
        "Provided technical support and organized workshops for Data Alchemists",
        "Organized a Hackathon-in-a-box for the Covalent community in Lagos"
      ]
    },
    {
      "id": 7,
      "title": "Tech Support / Data Analyst",
      "company": "Datatom.E.G.A",
      "location": "Edo State, Nigeria",
      "range": "2020 - 2021",
      "url": "#",
      "date": "2020-01-01",
      "responsibilities": [
        "Improved geospatial data accuracy by 15% through optimized data pipelines for Edo State Government project"
      ]
    },
    {
      "id": 8,
      "title": "Researcher",
      "company": "Farmsense.ng",
      "location": "Nigeria",
      "range": "2019 - 2020",
      "url": "#",
      "date": "2019-01-01",
      "responsibilities": [
        "Designed open geospatial data collection models for agriculture and supply chain resilience research in USAID-funded project"
      ]
    }
  ],
  "featured_projects": [
    {
      "id": 1,
      "title": "StormBot",
      "description": "Telegram-based multi-network trading bot delivering powerful analytics and intelligent trading tools. Features include snipe trading, instant swaps, real-time notifications, and secure wallet management with 10k+ daily transactions.",
      "tech": ["Node.js", "React", "PostgreSQL", "AWS", "Telegram API", "Web3", "Real-time Analytics"],
      "github": "#",
      "external": "https://stormbotx.io",
      "image": "stormbot.png",
      "date": "2024-02-01",
      "showInProjects": true
    },
    {
      "id": 2,
      "title": "Mansu Mobile Wallet",
      "description": "Mobile wallet app for Nigeria & Ghana users to buy, sell, swap, and send cryptocurrency using local fiat currencies. Supports Bitcoin, Ethereum, Tether, and TRON.",
      "tech": ["React Native", "Node.js", "PostgreSQL", "Blockchain APIs"],
      "github": "#",
      "external": "https://www.mansuwallet.com",
      "image": "mansuMobile.jpg",
      "date": "2023-08-01",
      "showInProjects": true
    },
    {
      "id": 3,
      "title": "Mansu Official Website",
      "description": "Official website for Mansu cryptocurrency platform, providing information and access to their financial services and mobile wallet application.",
      "tech": ["React", "Next.js", "Tailwind CSS", "Node.js"],
      "github": "#",
      "external": "https://www.mansu.io",
      "image": "mansuwebsite.png",
      "date": "2023-07-01",
      "showInProjects": true
    },
    {
      "id": 4,
      "title": "TCN Insight Live",
      "description": "Real-time Q&A and response application for live customer support and engagement, enabling seamless communication and instant feedback.",
      "tech": ["React", "WebSocket", "Node.js", "Express"],
      "github": "#",
      "external": "https://www.tcnqa.com",
      "image": "tcninsightlive.png",
      "date": "2023-06-01",
      "showInProjects": true
    },
    {
      "id": 5,
      "title": "Afrione Project",
      "description": "Blockchain-powered e-voucher system enabling cross-border payments and financial inclusion across Africa, the US, and the UK. Commissioned by Blockwave to design and deliver the full architecture and software stack.",
      "tech": ["Solidity", "React", "Node.js", "Web3", "MongoDB", "Blockchain"],
      "github": "#",
      "external": "#",
      "demo": "https://site.afrione.co/",
      "image": "photo_2023-10-21_10-18-57.jpg",
      "date": "2023-10-21",
      "showInProjects": true
    },
    {
      "id": 6,
      "title": "Prospero Credit Platform",
      "description": "Next-generation AI-powered credit platform that uses AI to match borrowers and lenders in real-time, performs AI-driven credit scoring using financial and behavioral data, and records all loans on a private blockchain.",
      "tech": ["Python", "TensorFlow", "Solidity", "React", "Node.js", "PostgreSQL", "AI/ML"],
      "github": "#",
      "external": "#",
      "demo": "#",
      "image": "logo.webp",
      "date": "2024-01-15",
      "showInProjects": true
    },
    {
      "id": 7,
      "title": "Auto360 Supplychain Protocol",
      "description": "Built a supply chain protocol on the Ethereum blockchain for tracking goods, providence and performing transactions using the Auto360 Token.",
      "tech": ["ReactJS", "Redux", "Styled Components", "Node.js", "Solidity"],
      "github": "#",
      "external": "http://axyz360auto.com",
      "image": "Axyz360.png",
      "date": "2022-12-01",
      "showInProjects": true
    },
    {
      "id": 8,
      "title": "DexSense",
      "description": "React-based Web Application utilizing the Covalent API to display DEX metrics across multiple chains supported by Covalent for comprehensive DeFi analytics.",
      "tech": ["ReactJS", "ethersJS", "Covalent API"],
      "github": "https://github.com/osazeejedi/DEX-Dashboard",
      "external": "https://dex-dashboard-pi.vercel.app/",
      "image": "dexsense.png",
      "date": "2022-11-01",
      "showInProjects": true
    }
    
  ]
}
